/*****************************************************************************************
 *
 * FILE NAME          : MxL_HRCLS_PhyCtrl.h
 * 
 * AUTHOR             : Mariusz Murawski
 *
 * DATE CREATED       : 11/19/2011
 *
 * DESCRIPTION        : Header file for MxL_HRCLS PHY control
 *                             
 *****************************************************************************************
 *                Copyright (c) 2011, MaxLinear, Inc.
 ****************************************************************************************/

#ifndef __MXL_HRCLS_PHY_CFG_H__
#define __MXL_HRCLS_PHY_CFG_H__

/*****************************************************************************************
    Include Header Files
    (No absolute paths - paths handled by make file)
*****************************************************************************************/
#include "MaxLinearDataTypes.h"
#include "MxL_HRCLS_CommonApi.h"
#include "MxL_HRCLS_OEM_Drv.h"
#include "MxL_HRCLS_SOC_Registers.h"

#ifdef _MXL_DIAG_ENABLED_
#include "../MxLDiag/MxL_DIAG_Api.h"
#endif // _MXL_DIAG_ENABLED_

/*****************************************************************************************
    Macros
*****************************************************************************************/
// Host command - HOST_CMD_CFG_DEV_UPSTREAM_PARAMS
#define MXL_HRCLS_HW_TXDAC_ENABLE           1
#define MXL_HRCLS_HW_TXDAC_DISABLE          0
#define MXL_HRCLS_HW_TXDAC_EXTERNAL         2


/* I2C COMMAND Communication: Command Code ID */
typedef enum
{
    HOST_CMD_CFG_SET_ADDR                     = 1,
    HOST_CMD_CFG_DOWNLOAD_SEGMENT             = 2,
    HOST_CMD_CFG_DOWNLOAD_DONE                = 3,

    HOST_CMD_CFG_DEV_REF_CLK_OUT              = 7,
    HOST_CMD_CFG_DEV_POWER_MODE               = 8,
    HOST_CMD_CFG_DEV_UPSTREAM_PARAMS          = 9,
    HOST_CMD_CFG_DEV_CHAN_CSF_COEF            = 10,
    HOST_CMD_CFG_DEV_CHAN_CSF_COEF_OOB        = 11,
    HOST_CMD_CFG_DEV_HOST_INTERRUPT_CONTROL   = 12,

    HOST_CMD_CFG_TUNER_CHAN_TUNE              = 13,
    HOST_CMD_CFG_TUNER_CHAN_FINE_RETUNE       = 14,
    HOST_CMD_CFG_TUNER_NARROWBAND_OUT_INTERFACE = 15,
    HOST_CMD_CFG_TUNER_ENABLE                 = 16,
    HOST_CMD_CFG_TUNER_DSCAL                  = 17,
    HOST_CMD_CFG_TUNER_IFOUT_PARAMS           = 18,
    HOST_CMD_CFG_FFT_STATE                    = 19,
    HOST_CMD_TEST                             = 20,
    HOST_CMD_REQ_DEMOD_EQUALIZER_COEFFICIENTS = 21,

    HOST_CMD_CFG_DEMOD_SYMBOL_RATE            = 26,
    HOST_CMD_CFG_DEMOD_OUT_PARAMS_OOB         = 27,
    HOST_CMD_CFG_DEMOD_ERRORS_OOB             = 28,
    HOST_CMD_CFG_DEMOD_MPEGOUT_PARAMS         = 29,
    HOST_CMD_CFG_DEMOD_MPEGOUT_GLOBAL_PARAMS  = 30,
    HOST_CMD_CFG_DEMOD_ANNEX_QAM_TYPE         = 31,
    HOST_CMD_CFG_DEMOD_INTR_MASK              = 32,
    HOST_CMD_CFG_DEMOD_ADC_IQ_FLIP            = 33,
    HOST_CMD_CFG_DEMOD_EQUALIZER_FILTER       = 34,
    HOST_CMD_CFG_DEMOD_ENABLE                 = 35,
    HOST_CMD_CFG_DEMOD_RESTART                = 36,
    HOST_CMD_REQ_DEMOD                        = 37,
    HOST_CMD_CFG_DEMOD_CARRIER_OFFSET_FLIP    = 38,
    HOST_CMD_CFG_DEMOD_RESAMPLE_RATE_RATIO    = 39,

    HOST_CMD_CFG_SERDES_MODE                  = 43,
    HOST_CMD_CFG_SERDES_DS_PARAMS             = 44,
    HOST_CMD_CFG_SERDES_DS_PRBS_PARAMS        = 45,
    HOST_CMD_CFG_SERDES_DS_PRE_EMPHASIS       = 46,
    HOST_CMD_CFG_SERDES_DS_AMPLITUDE          = 47,
    HOST_CMD_CFG_SERDES_DS_CROSSBAR           = 48,
    HOST_CMD_CFG_SERDES_US_PARAMS             = 49,
    HOST_CMD_CFG_SERDES_US_SYNC_PARAMS        = 50,
    HOST_CMD_CFG_SERDES_US_EQUALIZER          = 51,
    HOST_CMD_CFG_SERDES_US_LANE_SWITCH        = 52,
    HOST_CMD_CFG_SERDES_US_PRBS               = 53,
    HOST_CMD_CFG_SERDES_CLEAR                 = 54,
    HOST_CMD_REQ_SERDES                       = 55,
    HOST_CMD_PID_CFG                          = 56,
    HOST_CMD_PIF_CFG_ALL_PIDFILTERS           = 57,
    HOST_CMD_PID_READ_ANY_TSPACKET            = 58,

    HOST_CMD_XPT_INITPIDS                     = 60,
    HOST_CMD_XPT_SET_SCHEME                   = 61,
    HOST_CMD_CFG_FW_DEBUG                     = 63,
  // MAX_NUM_HOST_COMMAND
    MXL_HRCLS_HOST_CMD_MAX
} MXL_CMD_ID_E;

/* I2C COMMAND Communication: Response Code ID */
typedef enum
{
  RESPONSE_ID_SUCCESS = 0,
  RESPONSE_ID_NOT_READY,
  RESPONSE_ID_NOT_INTEGRATE,
  MAX_NUM_RESPONSE_ID
} MXL_RSP_ID_E;

/* Host command data structure */
typedef struct
{
  UINT8 syncChar;                    /* 0x00: Bit[7-4]:Packet sync character (0x0E),  bit[3-0]: serial */
  UINT8/*MXL_CMD_ID_E*/ commandId;   /* 0x01: command opcode = 0x02 for firmware download */
  UINT8 payloadCheckSum;             /* 0x02: Checksum of packet payload */
  UINT8 payloadLen;                  /* 0x03: Length of packet payload: 1 - 252 */
  UINT8 data[MXL_HRCLS_MAX_COMMAND_DATA_SIZE]; /* 0x04-0x0xFF: command field data */
} HOST_COMMAND_T;

/* Firmware response data structure */
typedef struct
{
  UINT8 syncChar;                    /* 0x00: Bit[7-4]:Packet sync character (0x0E),  bit[3-0]: serial */
  MXL_RSP_ID_E errorCode;            /* 0x01: Error code, 0x00 means ok. */
  UINT8 payloadCheckSum;             /* 0x02: Checksum of packet payload */
  UINT8 payloadLen;                  /* 0x03: Length of packet payload: 1 - 252 */
  UINT8 data[MXL_HRCLS_MAX_COMMAND_DATA_SIZE]; /* 0x04-0xFF: response field data */
} FW_RESPONSE_T, *PFW_RESPONSE_T;

typedef struct
{
  UINT8 id;                 /* 0x00-0x00: file identifier ('M') */
  UINT8 fmtVersion;         /* 0x01-0x01: file format version in ascii (default to '1') */
  UINT8 headerLen;          /* 0x02-0x02: header length (<256) in bytes, should be sizeof(MBIN_FILE_HEADER_T) */
  UINT8 numSegments;        /* 0x03-0x03: number of segments in the image (<256) */
  UINT8 entryAddress[4];    /* 0x04-0x07: entry address of execution, in big endian */
  UINT8 imageSize24[3];     /* 0x08-0x0A: 24-bit image size in bytes, not including header, in big endian */
  UINT8 imageChecksum;      /* 0x0B-0x0B: 8-bit checksum of file data, not including header */
  UINT8 reserved[4];        /* 0x0C-0x0F: reserved for future use */
} MBIN_FILE_HEADER_T;

typedef struct
{
  MBIN_FILE_HEADER_T  header;    /* 0x00: file header */
  UINT8 data[1];                 /* 0x10: place holder for accessing starting of filedata */
} MBIN_FILE_T;

typedef struct
{
  UINT8 id;                      /* 0x00-0x00: segment identifier (always 'S' for now) */
  UINT8 len24[3];                /* 0x01-0x03: data length in 24-bit big endian, not including header */
                                 /* PLEASE note: */
                                 /*    len24 is the real length of following data segement, and the next memory */
                                 /*    segment (if any) will start from next 32-bit aligned address, which is   */
                                 /*    &data[(len24+3)&(~3)]                                                    */
  UINT8 address[4];              /* 0x04-0x07: loading address of this segment, in big endian                   */
} MBIN_SEGMENT_HEADER_T;


typedef struct
{
  MBIN_SEGMENT_HEADER_T header;  /* 0x00: segment header */
  UINT8 data[1];                 /* 0x08: place holder for accessing starting of data */
} MBIN_SEGMENT_T;


typedef enum           
{                      
  MXL_HRCLS_FFT_MODE_IDLE = 0,
  MXL_HRCLS_FFT_MODE_SPECTRUM_API_DIAG = 1,
  MXL_HRCLS_FFT_MODE_SCAN = 2,   
  MXL_HRCLS_FFT_MODE_DEBUG = 3,    
  MXL_HRCLS_FFT_MODE_SPECTRUM_API = 4,
  MXL_HRCLS_FFT_MODE_INVALID = 5,  
} MXL_HRCLS_FFT_RUN_MODE_E;

typedef enum
{
  MXL_HRCLS_FFT_FB_SB = 0,
  MXL_HRCLS_FFT_FB_CHAN = 1,
  MXL_HRCLS_FFT_NB_CHAN = 2
} MXL_HRCLS_FFT_SOURCE_TYPE_E;

typedef enum         
{                      
  MXL_HRCLS_FFT_DEBUG_FFT = 0,     
  MXL_HRCLS_FFT_DEBUG_TIME = 1,    
  MXL_HRCLS_FFT_DEBUG_WINDOWED_TIME = 2,
} MXL_HRCLS_FFT_DEBUG_TYPE_E;

typedef struct
{
  UINT16 regAddr;
  UINT16 mask;
  UINT16 data;
} REG_CTRL_INFO_T, *PREG_CTRL_INFO_T;

typedef struct
{
  UINT16 regAddr;
  UINT8  lsbPos;
  UINT8  fieldWidth;
} MXL_HRCLS_FIELD_T;  

typedef struct
{
  UINT32 regAddr;
  UINT8  lsbPos;
