/******************************************************************************
*              Copyright 2004 - 2014, Hisilicon Tech. Co., Ltd.
*                           ALL RIGHTS RESERVED
* FileName: gfx2d_hal_hwc.c
* Description: Graphic 2D engine hwc code
*
* History:
* Version   Date         Author     DefectNum    Description
* main\1    2013-10-23              NULL         Create this file.
*******************************************************************************/
#include "hi_gfx2d_type.h"
#include "hi_gfx_comm_k.h"
#include "gfx2d_hal.h"
#include "hi_reg_common.h"
#include "hi_gfx2d_errcode.h"
#include "gfx2d_hal_hwc_filterPara.h"
#include "gfx2d_hal_hwc_adp.h"
#include "gfx2d_mem.h"
#include "gfx2d_config.h"
#include "drv_mmz.h"
#include "hi_gfx_sys_k.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif  /*__cplusplus*/
#endif  /*__cplusplus*/

#define HWC_REG_BASE_ADDR 0xf8c10000

#define HWC_ISRNUM 0x7b

#define GFX2D_HAL_MAX_NODE 7

#define GFX2D_CONFIG_MAX_ZMERATION 256

/*获取滤波系数的符号位及低9bit,组成10bit数*/
#define HWC_GET_BITS_OF_FILTERPARA(para) ((((para) & 0x80000000) >> 22) | ((para) & 0x1ff))

#define GFX2D_HAL_HWC_HSTEP_FLOATLEN 20
#define GFX2D_HAL_HWC_NOSCALE_HSTEP (0x1 << GFX2D_HAL_HWC_HSTEP_FLOATLEN)
#define GFX2D_HAL_HWC_VSTEP_FLOATLEN 12
#define GFX2D_HAL_HWC_NOSCALE_VSTEP (0x1 << GFX2D_HAL_HWC_VSTEP_FLOATLEN)

#define GFX2D_CONFIG_NODE_SIZE ((sizeof(HWC_NODE_S) + 0xf) & 0xffffff0)

typedef union tagHWC_POS_U
{
    struct
    {
        HI_U32 bit16X : 16;
        HI_U32 bit16Y : 16;
    } stBits;
    HI_U32 u32All;
} HWC_POS_U;

typedef union tagHWC_RES_U
{
    struct
    {
        HI_U32 bit16Width : 16;
        HI_U32 bit16Height : 16;
    } stBits;
    HI_U32 u32All;
} HWC_RES_U;

typedef union tagHWC_VHDCSCIDC_U
{
    struct
    {
        HI_U32 bit9Idc0 : 9;
        HI_U32 bit9Idc1 : 9;
        HI_U32 bit9Idc2 : 9;
        HI_U32 bit1IsEnable : 1;
        HI_U32 bit1Reserved : 4;
    } stBits;
    HI_U32 u32All;
} HWC_VHDCSCIDC_U;

typedef union tagHWC_VHDCSCODC_U
{
    struct
    {
        HI_U32 bit9Odc0 : 9;
        HI_U32 bit9Odc1 : 9;
        HI_U32 bit9Odc2 : 9;
        HI_U32 bit5Reserved : 5;
    } stBits;
    HI_U32 u32All;
} HWC_VHDCSCODC_U;

typedef union tagHWC_VHDCSCPARAM_U
{
    struct
    {
        HI_U32 bit15Param0 : 15;
        HI_U32 bit1Reserved1 : 1;
        HI_U32 bit15Param1 : 15;
        HI_U32 bit1Reserved2 : 1;
    } stBits;
    HI_U32 u32All;
} HWC_VHDCSCPARAM_U;

typedef union tagHWC_VHDHSP_U
{
    struct
    {
        HI_U32 bit24Ratio : 24;
        HI_U32 bit1Order : 1;
        HI_U32 bit1ChrmoaMode : 1;
        HI_U32 bit1LumMode : 1;
        HI_U32 bit1AlphaMode : 1;
        HI_U32 bit1IsChromaMid : 1;
        HI_U32 bit1IsLumMid : 1;
        HI_U32 bit1IsChromaEnable : 1;
        HI_U32 bit1IsLumEnable : 1;
    } stBits;
    HI_U32 u32All;
} HWC_VHDHSP_U;

typedef union tagHWC_VHDHOFFSET_U
{
    struct
    {
        HI_U32 bit28Offset : 28;
        HI_U32 bit4Reserved : 4;
    } stBits;
    HI_U32 u32All;
} HWC_VHDHOFFSET_U;

typedef union tagHWC_VHDVSP_U
{
    struct
    {
        HI_U32 bit19Reserved : 19;
        HI_U32 bit2InFmt : 2;
        HI_U32 bit2OutFmt : 2;
        HI_U32 bit1ChromaMode : 1;
        HI_U32 bit1LumMode : 1;
        HI_U32 bit1Reserved1 : 1;
        HI_U32 bit1ChromaTap : 1;
        HI_U32 bit1Reserved2 : 1;
        HI_U32 bit1IsChromaMid : 1;
        HI_U32 bit1IsLumMid : 1;
        HI_U32 bit1IsChromaEnable : 1;
        HI_U32 bit1IsLumEnable : 1;
    } stBits;
    HI_U32 u32All;
} HWC_VHDVSP_U;

typedef union tagHWC_CBMMIX_U
{
    struct
    {
        HI_U32 bit3Prio0 : 3;
        HI_U32 bit3Prio1 : 3;
        HI_U32 bit3Prio2 : 3;
        HI_U32 bit3Prio3 : 3;
        HI_U32 bit3Prio4 : 3;
        HI_U32 bit3Prio5 : 3;
        HI_U32 bit3Prio6 : 3;
        HI_U32 bit4AluMode              : 4   ; /* [24..21]  */
        HI_U32 bit1CbmMode              : 1   ; /* [25]  */
        HI_U32 bit5Reserved            : 5   ; /* [30..26]  */
        HI_U32 bit1En                : 1   ; /* [31]  */
    } stBits;
    HI_U32 u32All;
} HWC_CBMMIX_U;

typedef union tagHWC_OUTCSCIDC_U
{
    struct
    {
        HI_U32 bit9Idc0 : 9;
        HI_U32 bit9Idc1 : 9;
        HI_U32 bit9Idc2 : 9;
        HI_U32 bit1IsEnable : 1;
        HI_U32 bit4Reserved : 4;
    } stBits;
    HI_U32 u32All;
} HWC_OUTCSCIDC_U;

typedef union tagHWC_OUTCSCODC_U
{
    struct
    {
        HI_U32 bit9Odc0 : 9;
        HI_U32 bit9Odc1 : 9;
        HI_U32 bit9Odc2 : 9;
        HI_U32 bit5Reserved : 5;
    } stBits;
    HI_U32 u32All;
} HWC_OUTCSCODC_U;

typedef union tagHWC_OUTCSCPARAM_U
{
    struct
    {
        HI_U32 bit15Param0 : 15;
        HI_U32 bit1Reserved1 : 1;
        HI_U32 bit15Param1 : 15;
        HI_U32 bit1Reserved2 : 1;
    } stBits;
    HI_U32 u32All;
} HWC_OUTCSCPARAM_U;

typedef union tagHWC_CMPCTRL_U
{
    struct
    {
        HI_U32 bit1CmpEnable : 1;
        HI_U32 bit1LossEnable : 1;
        HI_U32 bit1SgmtType : 1;
        HI_U32 bit29Reserved : 29;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCTRL_U;

typedef union tagHWC_CROPPOS_U
{
    struct
    {
        HI_U32 bit13XPos : 13;
        HI_U32 bit3Reserved1 : 3;
        HI_U32 bit13YPos : 13;
        HI_U32 bit2Reserved2 : 2;
        HI_U32 bit1IsEnable : 1;
    } stBits;
    HI_U32 u32All;
} HWC_CROPPOS_U;

typedef union tagHWC_CROPRESO_U
{
    struct
    {
        HI_U32 bit13Width : 13;
        HI_U32 bit3Reserved1 : 3;
        HI_U32 bit13Height : 13;
        HI_U32 bit2Reserved2 : 3;
    } stBits;
    HI_U32 u32All;
} HWC_CROPRESO_U;

typedef union tagHWC_CMPGLBINFO_U
{
    struct
    {
        HI_U32 bit1IsLossLess : 1;
        HI_U32 bit1IsAlphaLossLess : 1;
        HI_U32 bit1Mode : 1;
        HI_U32 bit2OsdMode : 2;
        HI_U32 bit1IsPartition : 1;
        HI_U32 bit3PartitionNum : 3;
        HI_U32 bit23Reserved : 23;
    } stBits;
    HI_U32 u32All;
} HWC_CMPGLBINFO_U;

typedef union tagHWC_CMPRESO_U
{
    struct
    {
        HI_U32 bit13Width : 13;
        HI_U32 bit3Reserved1 : 3;
        HI_U32 bit13Height : 13;
        HI_U32 bit2Reserved2 : 3;
    } stBits;
    HI_U32 u32All;
} HWC_CMPRESO_U;

typedef union tagHWC_CMPCFG0_U
{
    struct
    {
        HI_U32 bit10BudgetBitsMb : 10;
        HI_U32 bit6Reserved1 : 6;
        HI_U32 bit10MinMbBits : 10;
        HI_U32 bit2Reserved2 : 6;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG0_U;

typedef union tagHWC_CMPCFG1_U
{
    struct
    {
        HI_U32 bit10BudgetBitsMbCap : 10;
        HI_U32 bit6Reserved : 22;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG1_U;

typedef union tagHWC_CMPCFG2_U
{
    struct
    {
        HI_U32 bit4MaxQp : 4;
        HI_U32 bit4Reserved1 : 4;
        HI_U32 bit4SadBitsNgain : 4;
        HI_U32 bit4Reserved2 : 4;
        HI_U32 bit3RcSmthNgain : 3;
        HI_U32 bit5Reserved3 : 5;
        HI_U32 bit4SpecialBitGain : 4;
        HI_U32 bit4Reserved4 : 4;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG2_U;

typedef union tagHWC_CMPCFG3_U
{
    struct
    {
        HI_U32 bit7MaxSadThr : 7;
        HI_U32 bit9Reserved1 : 9;
        HI_U32 bit7MinSadThr : 7;
        HI_U32 bit9Reserved2 : 9;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG3_U;

typedef union tagHWC_CMPCFG4_U
{
    struct
    {
        HI_U32 bit7SmthThr : 7;
        HI_U32 bit1Reserved1 : 1;
        HI_U32 bit7StillThr : 7;
        HI_U32 bit1Reserved2 : 1;
        HI_U32 bit10BigGradThr : 10;
        HI_U32 bit6Reserved3 : 6;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG4_U;

typedef union tagHWC_CMPCFG5_U
{
    struct
    {
        HI_U32 bit6SmthPixNumThr : 6;
        HI_U32 bit2Reserved1 : 2;
        HI_U32 bit6StillPixNumThr : 6;
        HI_U32 bit2Reserved2 : 2;
        HI_U32 bit6NoisePixNumThr : 6;
        HI_U32 bit2Reserved3 : 2;
        HI_U32 bit6LargeSmthPixNumThr : 6;
        HI_U32 bit2Reserved4 : 2;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG5_U;

typedef union tagHWC_CMPCFG6_U
{
    struct
    {
        HI_U32 bit7NoiseSad : 7;
        HI_U32 bit9Reserved1 : 9;
        HI_U32 bit9PixDiffThr : 9;
        HI_U32 bit7Reserved2 : 7;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG6_U;

typedef union tagHWC_CMPCFG7_U
{
    struct
    {
        HI_U32 bit7AdjSadBitsThr : 7;
        HI_U32 bit1Reserved1 : 1;
        HI_U32 bit8MaxTrowBits : 8;
        HI_U32 bit16Reserved2 : 16;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG7_U;

typedef union tagHWC_CMPCFG8_U
{
    struct
    {
        HI_U32 bit8QpInc1BitsThr : 8;
        HI_U32 bit8QpDec1BitsThr : 8;
        HI_U32 bit8QpInc2BitsThr : 8;
        HI_U32 bit8QpDec2BitsThr : 8;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG8_U;

typedef union tagHWC_CMPCFG9_U
{
    struct
    {
        HI_U32 bit10ForceQpThr : 10;
        HI_U32 bit6Reserved1 : 6;
        HI_U32 bit10ForceQpThrCap : 10;
        HI_U32 bit6Reserved2 : 6;
    } stBits;
    HI_U32 u32All;
} HWC_CMPCFG9_U;

typedef struct tagHWC_REG_S
{
    HI_U32 u32AqListHeadAddr;
    HI_U32 u32HwcCtl;
    HI_U32 u32MaskInt;
    HI_U32 u32IntClr;
    HI_U32 u32Int;
    HI_U32 u32TimeCnt;
    HI_U32 u32MiscEllaneous;
} HWC_REG_S;

typedef union tagHWC_SRCCTL_U
{
    struct
    {
        HI_U32 bit6Fmt             : 6   ; /* [5..0]  */
        HI_U32 bit5ArgbOrder       : 5   ; /* [10..6]  */
        HI_U32 bit1UVOrder         : 1   ; /* [11]  */
        HI_U32 bit2ExpandMode      : 2   ; /* [13..12]  */
        HI_U32 bit4Reserved0       : 4   ; /* [17..14]  */
        HI_U32 bit1AlphaRange      : 1   ; /* [18]  */
        HI_U32 bit1VScanOrd        : 1   ; /* [19]  */
        HI_U32 bit1HScanOrd        : 1   ; /* [20]  */
        HI_U32 bit1422Pro          : 1   ; /* [21]  */
        HI_U32 bit7Reserved1       : 7   ; /* [28..22]  */
        HI_U32 bit1Dma             : 1   ; /* [29]  */
        HI_U32 bit1IsDim           : 1   ; /* [30]  */
        HI_U32 bit1IsEnable        : 1   ; /* [31]  */
    } stBits;
    HI_U32 u32All;
} HWC_SRCCTL_U;

typedef union tagHWC_ALPHA_U
{
    struct
    {
        HI_U32 bit8Alpha0           : 8   ; /* [7..0]  */
        HI_U32 bit8Alpha1           : 8   ; /* [15..8]  */
        HI_U32 bit16Reserved        : 16  ; /* [31..16]  */
    } stBits;
    HI_U32 u32All;
} HWC_ALPHA_U;

typedef struct tagHWC_LAYER_S
{
    HWC_SRCCTL_U unCtrl;                    /* 0x0 */
    HI_U32 u32Phyaddr;                      /* 0x4 */
    HI_U32 u32CbcrPhyaddr;                      /* 0x8 */
    HI_U32 u32Stride;                       /* 0xc */
    HI_U32 u32CbcrStride;                    /* 0x10 */
    HWC_RES_U unRes;                        /* 0x14 */
    HI_U32 u32DimValue;                     /* 0x18 */
    HWC_ALPHA_U unAlpha;                    /* 0x1c */
    HI_U32 u32PixOffset;                        /* 0x20 */
    HI_U32 u32Reserved[7];                  /* 0x24~0x3c */
} HWC_LAYER_S;

typedef union tagHWC_OUTCTL_U
{
    struct
    {
        HI_U32 bit6Fmt : 6;
        HI_U32 bit5ArgbOrder : 5;
        HI_U32 bit1CbcrOrder : 1;
        HI_U32 bit5Reserved0 : 5;
        HI_U32 bit1Dither  : 1;
        HI_U32 bit1AlphaRange : 1;
        HI_U32 bit1VScanOrder : 1;
        HI_U32 bit1HScanOrder : 1;
        HI_U32 bit2Reserved1 : 2;
        HI_U32 bit1CmpEn : 1;
        HI_U32 bit1CmpAddrChangeEn : 1;
        HI_U32 bit2Reserved2 : 2;
        HI_U32 bit1ChormeMmuBypass : 1;
        HI_U32 bit1LumMmuBypass : 1;
        HI_U32 bit1ARMmuBypass : 1;
        HI_U32 bit1GBMmuBypass : 1;
        HI_U32 bit1Enable : 1;
    } stBits;
    HI_U32 u32All;
} HWC_OUTCTL_U;

/* Define the union U_DES_ALPHA */
typedef union tagHWC_OUTALPHA_U
{
    struct
    {
        HI_U32 bit8AlphaThreshold   : 8   ; /* [7..0]  */
        HI_U32 bit1CropMode         : 1   ; /* [8]  */
        HI_U32 bit1CropEn           : 1   ; /* [9]  */
        HI_U32 bit22Reserved        : 22  ; /* [31..10]  */
    } stBits;
    HI_U32 u32All;
} HWC_OUTALPHA_U;

typedef union tagHWC_MMU_PROT_CTL_U
{
    struct
    {
        HI_U32 bit1Src1Ch0MmuBypass   : 1   ; /* [0]  */
        HI_U32 bit1Src1Ch1MmuBypass   : 1   ; /* [1]  */
        HI_U32 bit1Src2Ch0MmuBypass   : 1   ; /* [2]  */
        HI_U32 bit1Src2Ch1MmuBypass   : 1   ; /* [3]  */
        HI_U32 bit1Src3MmuBypass      : 1   ; /* [4]  */
        HI_U32 bit1Src4MmuBypass       : 1   ; /* [5]  */
        HI_U32 bit1Src5MmuBypass       : 1   ; /* [6]  */
        HI_U32 bit1Src6MmuBypass       : 1   ; /* [7]  */
        HI_U32 bit1Src7MmuBypass       : 1   ; /* [8]  */
        HI_U32 bit1ClutMmuBypass       : 1   ; /* [9]  */
        HI_U32 bit6Reserved0            : 6   ; /* [15..10]  */
        HI_U32 bit1Src1Ch0Prot         : 1   ; /* [16]  */
        HI_U32 bit1Src1Ch1Prot         : 1   ; /* [17]  */
        HI_U32 bit1Src2Ch0Prot         : 1   ; /* [18]  */
        HI_U32 bit1Src2Ch1Prot         : 1   ; /* [19]  */
        HI_U32 bit1Src3Prot             : 1   ; /* [20]  */
        HI_U32 bit1Src4Prot             : 1   ; /* [21]  */
        HI_U32 bit1Src5Prot             : 1   ; /* [22]  */
        HI_U32 bit1Src6Prot             : 1   ; /* [23]  */
        HI_U32 bit1Src7Prot             : 1   ; /* [24]  */
        HI_U32 bit7Reserved1            : 7   ; /* [31..25]  */
    } stBits;
    HI_U32 u32All;
} HWC_MMU_PROT_CTL_U;

typedef union tagHWC_HPZME_U
{
    struct
    {
        HI_U32 bit1ZmehDwsm             : 1   ; /* [0]  */
        HI_U32 bit3Reserved0            : 3   ; /* [3..1]  */
        HI_U32 bit4ZmehDwsMode          : 4   ; /* [7..4]  */
        HI_U32 bit24Reserved1           : 24  ; /* [31..8]  */
    } stBits;
    HI_U32 u32All;
} HWC_HPZME_U;

typedef union tagHWC_CSCMUX_U
{
    struct
    {
        HI_U32 bit1CscMode              : 1   ; /* [0]  */
        HI_U32 bit1OutPremultEn         : 1   ; /* [1]  */
        HI_U32 bit30Reserved            : 30  ; /* [31..2]  */
    } stBits;
    HI_U32 u32All;
} HWC_CSCMUX_U;

typedef union tagHWC_OUTDSWM_U
{
    struct
    {
        HI_U32 bit2HDswmMode       : 2   ; /* [1..0]  */
        HI_U32 bit2Reserved0            : 2   ; /* [3..2]  */
        HI_U32 bit1VDswmMode       : 1   ; /* [4]  */
        HI_U32 bit27Reserved1            : 27  ; /* [31..5]  */
    } stBits;
    HI_U32 u32All;
} HWC_OUTDSWM_U;

typedef union tagHWC_CBMPARA_U
{
    struct
    {
        HI_U32 bit1GlobalAlphaEnable           : 1   ; /* [0]  */
        HI_U32 bit1PixelAlphaEnable           : 1   ; /* [1]  */
        HI_U32 bit1bPreMul          : 1   ; /* [2]  */
        HI_U32 bit1MultiGEn      : 1   ; /* [3]  */
        HI_U32 bit4BlendMode          : 4   ; /* [7..4]  */
        HI_U32 bit8GlobalAlpha             : 8   ; /* [15..8]  */
        HI_U32 bit15Reserved            : 15  ; /* [30..16]  */
        HI_U32 bit1bCovBlend       : 1   ; /* [31]  */
    } stBits;
    HI_U32 u32All;
} HWC_CBMPARA_U;

typedef struct tagHWC_CBMINFO_S
{
    HWC_CBMPARA_U unCbmPara;
    HWC_POS_U unCbmStartPos;
} HWC_CBMINFO_S;

typedef union tagHWC_INTMASK_U
{
    struct
    {
        HI_U32 bit1NodeCompMask              : 1   ; /* [0]  */
        HI_U32 bit1TimeoutMask          : 1   ; /* [1]  */
        HI_U32 bit1BusErrMask          : 1   ; /* [2]  */
        HI_U32 bit1ListCompMask          : 1   ; /* [3]  */
        HI_U32 bit28Reserved            : 28  ; /* [31..4]  */
    } stBits;
    HI_U32 u32All;
} HWC_INTMASK_U;

typedef struct tagHWC_NODE_S
{
    HWC_LAYER_S astLayer[7];                /*0x0 ~ 0x1bc*/
    HWC_OUTCTL_U unOutCtl;                  /* 0x1c0 */
    HI_U32 u32OutPhyaddr;                   /* 0x1c4 */
    HI_U32 u32OutChromPhyaddr;                   /* 0x1c8 */
    HI_U32 u32OutStride;                 /* 0x1cc */
    HI_U32 u32OutChromStride;                 /* 0x1d0 */
    HWC_RES_U unOutRes;                     /* 0x1d4 */
    HWC_OUTALPHA_U unOutAlpha;              /* 0x1d8 */
    HWC_POS_U unOutCropStart;                  /* 0x1dc */
    HWC_POS_U unOutCropEnd;                    /* 0x1e0 */
    HWC_MMU_PROT_CTL_U unMmuCtl;            /* 0x1e4 */
    HI_U32 u32OutPixOffset;                        /* 0x1e8 */
    HI_U32 u32ARAddr;                       /* 0x1ec */
    HI_U32 u32GBAddr;                       /* 0x1f0 */
    HI_U32 u32Reserved0[3];                 /* 0x1f4~0x1fc */

    HWC_VHDHSP_U unHsp;                     /* 0x200 */
    HWC_VHDHOFFSET_U unHLumOffset;          /* 0x204 */
    HWC_VHDHOFFSET_U unHChromaOffset;       /* 0x208 */
    HWC_VHDVSP_U unVsp;                     /* 0x20c */
    HI_U32 u32Vsr;                          /* 0x210 */
    HI_U32 u32VOffset;                      /* 0x214 */
    HWC_RES_U unZmeOutRes;                  /* 0x218 */
    HWC_RES_U unZmeInRes;                   /* 0x21c */
    HI_U32 u32Reserved1[2];                 /* 0x220~0x224 */

    HWC_HPZME_U  unHpZme;                   /* 0x228 */
    HWC_RES_U unHpZmeReso;                  /* 0x22c */

    HWC_OUTCSCIDC_U unVhdCscIdc;               /* 0x230 */
    HWC_OUTCSCODC_U unVhdCscOdc;               /* 0x234 */

    HWC_OUTCSCPARAM_U unVhdCscParam0;          /* 0x238 */
    HWC_OUTCSCPARAM_U unVhdCscParam1;          /* 0x23c */
    HWC_OUTCSCPARAM_U unVhdCscParam2;          /* 0x240 */
    HWC_OUTCSCPARAM_U unVhdCscParam3;          /* 0x244 */
    HWC_OUTCSCPARAM_U unVhdCscParam4;          /* 0x248 */


    HI_U32 u32Reserved2[13];                /* 0x24c~0x27c */
    HWC_VHDHSP_U unVhdHsp;                  /* 0x280 */
    HWC_VHDHOFFSET_U unVhdLumHOffset;       /* 0x284 */
    HWC_VHDHOFFSET_U unVhdChromaHOffset;    /* 0x288 */
    HWC_VHDVSP_U unVhdVsp;                  /* 0x28c */
    HI_U32 u32VhdVsr;                       /* 0x290 */
    HI_U32 u32VhdVOffset;                   /* 0x294 */
    HWC_RES_U unVhdZmeOutRes;               /* 0x298 */
    HWC_RES_U unVhdZmeInRes;                /* 0x29c */
    HI_U32 u32Reserved3[2];                 /* 0x2a0~0x2a4 */
    HWC_HPZME_U unVhdHpZme;                 /* 0x2a8 */
    HWC_RES_U unVhdHpZmeReso;               /* 0x2ac */

    HWC_CSCMUX_U unCscMux;                  /* 0x2b0 */
    HI_U32 Reserved4[3];                    /* 0x2b4~0x2bc */

    HWC_OUTCSCIDC_U unOutCscIdc;            /* 0x2c0 */
    HWC_OUTCSCODC_U unOutCscOdc;            /* 0x2c4 */
    HWC_OUTCSCPARAM_U unOutCscParam0;       /* 0x2c8 */
    HWC_OUTCSCPARAM_U unOutCscParam1;       /* 0x2cc */
    HWC_OUTCSCPARAM_U unOutCscParam2;       /* 0x2d0 */
    HWC_OUTCSCPARAM_U unOutCscParam3;       /* 0x2d4 */
    HWC_OUTCSCPARAM_U unOutCscParam4;       /* 0x2d8 */

    HWC_OUTDSWM_U unOutDswm;                /* 0x2dc */
    HI_U32 Reserved5[8];                    /* 0x2e0~0x2fc */

    HWC_CBMMIX_U unCbmMix;                  /* 0x300 */
    HI_U32 u32CbmBkgValue;                  /* 0x304 */

    HI_U32 Reserved6[6];                    /* 0x308~0x31c */

    HWC_CBMINFO_S astCmbInfo[7];            /* 0x320~0x354 */

    HI_U32 Reserved7[26];                   /* 0x358~0x3bc */

    HWC_CMPGLBINFO_U unCmpGlbInfo;          /* 0x3c0 */
    HWC_CMPRESO_U unCmpReso;                /* 0x3c4 */
    HWC_CMPCFG0_U unCmpCfg0;                /* 0x3c8 */
    HWC_CMPCFG1_U unCmpCfg1;                /* 0x3cc */
    HWC_CMPCFG2_U unCmpCfg2;                /* 0x3d0 */
    HWC_CMPCFG3_U unCmpCfg3;                /* 0x3d4 */
    HWC_CMPCFG4_U unCmpCfg4;                /* 0x3d8 */
    HWC_CMPCFG5_U unCmpCfg5;                /* 0x3dc */
    HWC_CMPCFG6_U unCmpCfg6;                /* 0x3e0 */
    HWC_CMPCFG7_U unCmpCfg7;                /* 0x3e4 */
    HWC_CMPCFG8_U unCmpCfg8;                /* 0x3e8 */
    HWC_CMPCFG9_U unCmpCfg9;                /* 0x3ec */
    HI_U32 u32CmpMaxRowLen;                 /* 0x3f0 */
    HI_U32 Reserved8[35];                   /* 0x3f4~0x47c */
    HI_U32 u32G0HCoefPhyaddr;               /* 0x480 */
    HI_U32 u32G0VCoefPhyaddr;               /* 0x484 */
    HI_U32 u32G0HChromaCoefPhyaddr;         /* 0x488 */
    HI_U32 u32G0VChromaCoefPhyaddr;         /* 0x48c */
    HI_U32 u32HCoefPhyaddr;                 /* 0x490 */
    HI_U32 u32VCoefPhyaddr;                 /* 0x494 */
    HI_U32 u32HChromaCoefPhyaddr;           /* 0x498 */
    HI_U32 u32VChromaCoefPhyaddr;           /* 0x49c */
    HI_U32 Reserved9[20];                   /* 0x4a0~0x4ec */
    HI_U32 u32AXIID;                        /* 0x4f0 */
    HI_U32 u32NodeId;                       /* 0x4f4 */
    HWC_INTMASK_U unIntMask;                /* 0x4f8 */
    HI_U32 u32NextNodePhyaddr;
    HI_VOID *pNextNode;
    HI_VOID *pFirstNode;
} HWC_NODE_S;

/*硬件层ID定义*/
typedef enum
{
    HWC_LAYER_VHD = 0x1,
    HWC_LAYER_G0,
    HWC_LAYER_G1,
    HWC_LAYER_G2,
    HWC_LAYER_G3,
    HWC_LAYER_G4,
    HWC_LAYER_G5,
    HWC_LAYER_BUTT
} HWC_LAYER_ID;

/*水平系数存储方式:每8个系数一组，3 + 3 + 2 占用12byte*/
#define HWC_HORIZON_LUM_PARA_SIZE_PERLEVEL (((HWC_FILTER_PHASE * 12) + 0xf) & 0xfffffff0)

/*垂直系数存储方式:每4个系数一组，占用8byte*/
#define HWC_VERTICAL_LUM_PARA_SIZE_PERLEVEL (((HWC_FILTER_PHASE * 8) + 0xf) & 0xfffffff0)

#define HWC_HORIZON_CHM_PARA_SIZE_PERLEVEL (((HWC_FILTER_PHASE * 12) + 0xf) & 0xfffffff0)
#define HWC_VERTICAL_CHM_PARA_SIZE_PERLEVEL (((HWC_FILTER_PHASE * 8) + 0xf) & 0xfffffff0)

#define HWC_HORIZON_PARA_SIZE_PERLEVEL (HWC_HORIZON_LUM_PARA_SIZE_PERLEVEL)
#define HWC_VERTICAL_PARA_SIZE_PERLEVEL (HWC_VERTICAL_LUM_PARA_SIZE_PERLEVEL)

