/******************************************************************************

  Copyright (C), 2014-2024, Hisilicon Tech. Co., Ltd.

 ******************************************************************************
  File Name     : hdmi_hal_cec.c
  Version       : Initial Draft
  Author        : Hisilicon multimedia software group
  Created       : 2015/08/13
  Description   :
  History       :
  Date          : 2015/08/13
  Author        : t00273561
  Modification  :
*******************************************************************************/

#include <linux/jiffies.h>
#include <linux/delay.h>

#include "hdmi_hal_cec.h"
#include "hdmi_hal_intf.h"

#include "hdmi_reg_cec.h"
#include "hdmi_reg_aon.h"


typedef union
{
    struct{
        HI_U16      bit01_tv            : 1     ; /* 00 */
        HI_U16      bit01_record_dev1   : 1     ; /* 01 */
        HI_U16      bit01_record_dev2   : 1     ; /* 02 */
        HI_U16      bit01_tuner1        : 1     ; /* 03 */
        HI_U16      bit01_playback_dev1 : 1     ; /* 04 */
        HI_U16      bit01_audio_sys     : 1     ; /* 05 */
        HI_U16      bit01_tuner2        : 1     ; /* 06 */
        HI_U16      bit01_tuner3        : 1     ; /* 07 */
        HI_U16      bit01_playback_dev2 : 1     ; /* 08 */
        HI_U16      bit01_record_dev3   : 1     ; /* 09 */
        HI_U16      bit01_tuner4        : 1     ; /* 10 */
        HI_U16      bit01_playback_dev3 : 1     ; /* 11 */
        HI_U16      bit01_reserved1     : 1     ; /* 12 */
        HI_U16      bit01_reserved2     : 1     ; /* 13 */
        HI_U16      bit01_specific_use  : 1     ; /* 14 */
        HI_U16      bit01_broadcast     : 1     ; /* 15 */
    }bits;

    HI_U16 u16;
}CEC_LOGIC_ADDR_U;


#define CEC_ADDR_MASK       0xf
#define CEC_ADDR_TX         0x8     /* tunner 1 */


#define CEC_NULL_CHK(p) do{\
	if(HI_NULL == p)\
	{HDMI_WARN("%s is null pointer!return fail.\n",#p);\
	return HI_FAILURE;}\
}while(0)

#define CEC_INIT_CHK(pstCecInfo) do{\
	CEC_NULL_CHK(pstCecInfo);\
	if(pstCecInfo->bInit != HI_TRUE)\
	{HDMI_WARN("cec module didn't init!\n");\
	return HI_FAILURE;}\
}while(0)


#if 0
typedef enum
{

    CEC_INTR_tx_fifo_full,
    CEC_INTR_start_odd_bit,
    CEC_INTR_short_pulse_detect,
    CEC_INTR_rx_fifo_overrun,
    CEC_INTR_rx_cmd_set,
    CEC_INTR_tx_fifo_empty,
    CEC_INTR_tx_ff_cstate_set,
    CEC_INTR_rx_fifo_nempty,
    CEC_INTR_low_min_err,
    CEC_INTR_BUTT,

}CEC_INTR_E;
#endif

#define CEC_AUTOPING_TIMEOUT    5000
#define CEC_RX_READ_TIMEOUT     200
#define CEC_TX_WRITE_TIMEOUT    3000


